
// void main() {
//================== if else ======================
//  if - else if - else คือ ถ้าเงื่อนไขเป็นจริงจะทำงานแล้วออกไปจากเงื่อนไขทันที
  // const number = 5;
  // if (number < 10) {
  //   print('yes');//ทำรายการนี้
  // } else if (number > 10) {
  //   print('No');//ไม่ทำรายการนี้
  // } else {
  //   print('End Program');//ไม่ทำรายการนี้
  // }

  //================ while loop =====================
  //จะใช้รูปแบบ จะหยุด loop เมื่อเงื่อนไขเป็นเท็จ
  //ใช้เมื่อไม่รู้ว่าจะต้องวนกี่รอบ
  //  int i = 0;
  // while (true) {
  //   if (i == 10) {
  //     break;
  //   }
  //   print(i);
  //   i++;
  // }

  //================== for loop ===================
// ใช้เมื่อรู้ว่าจะให้ loop กี่รอบ
  // for (var i = 0; i < 10; i++) {
  //   print(i);
  // }

//=================== brake and continue ==============
//break หมายถึงให้ออกจากวงวนไปเลย
//continue คือให้ทำงานถัดไปไม่ต้องทำงานที่มีคำสั่ง continue
//continue ไม่ใช้กับ while
  // for (int i = 0; i < 5; i++) {
  //   if (i == 2) {
  //     print('this is continue');
  //     continue;//ไม่ทำคำสั่งนี้ให้ข้ามไปทำคำสั่งต่อไป
  //   }
  //   print(i);
  // }
  // print('++++++++++++++++++++++');
  // for (int i = 0; i < 9; i++) {
  //   if (i == 2) {
  //     print('this is break');
  //     break;//หยุดการทำงานออกจากวงวนไปเลย
  //   }
  //   print(i);
  // }
  // int i = 0;
  // while (i < 5) {
  //   print(i);//ใช้งานกับ while แล้วมักมีปัญหาควบคุมยากเนื่องจาก เจอคำสั่ง continue
  //แล้วจะไม่ออกจากคำสั่งต้องหาเงื่อนไขในการออก
  //   if (i == 2) {
  //     print('this is continue');
  //      i++;
  //     continue;
  //   }
  //   i++;
  // }

//====================== switch case ===================
// องค์ประกอบของ switch คือ switch(){}
//รับอากิวเมนต์เข้ามาทำงาน const post=1;ในส่วนของปีกกาต้องมี
// คำสั่ง case นำอากิวเมนต์มาทำงานเป็นแบบ map
//ต้องมีคำสั่ง break ด้วยก่อนจบเคส
//การทำงานจะเหมือน else if คือจะออกจาก switch เมื่อเงือนไขเป็นจริง
//การทำงานสุดท้ายคำ default จะทำเงื่อนไขนี้ถ้าทุกเงื่อนใขด้วนบนไม่เป็นจริง
//ทำงานเหมือน else
  // const pos = 10;
  // switch (pos) {
  //   case 1:
  //     print('gold');
  //     break;
  //   case 2:
  //     print('silver');
  //     break;
  //   case 3:
  //     print('metal');
  //     break;
  //   default:
  //     print('End Program');
  //     break;
  // }
// }

